Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Printing Constants and Variables
ja: 定数と変数を出力する

source: Printing the description of each item in the array shows that their default states have been set as expected.
ja: 配列の各項目の説明を出力することは、予想されるようにそれらの省略時の状態が設定されたことを示します。

source: Private Members in Extensions
ja: 拡張の中の非公開メソッド

source: Private members declared in the type’s declaration can be accessed from extensions, and private members declared in one extension can be accessed from other extensions and from the type’s declaration.
ja: 型の持つ宣言において宣言される非公開メンバは拡張からアクセスできます、そして一方の拡張において宣言される非公開メンバは他方の拡張からそしてその型のもつ宣言からアクセスできます。

source: Program execution continues at the point immediately following the function or method call.
ja: プログラム実行は、関数またはメソッド呼び出しに直ちに続いている地点に続きます。

source: Program execution continues to the next case even if the patterns of the case label do not match the value of the switch statement’s control expression.
ja: たとえケース節ラベルのパターンがswitch文のもつ制御式の値にマッチしないとしても、プログラム実行は次のケース節に続きます。

source: Program execution does not continue or “fall through” to the next case or default case.
ja: プログラム実行は続きません、あるいは、次のケース節または省略時のケース節に「抜け落ちる」ことはありません。

source: Projecting a Value From a Property Wrapper
ja: 値をプロパティラッパーから予測する

source: Propagating Errors Using Throwing Functions
ja: スロー関数を使ってエラーを伝える

source: Propagation of Initialization Failure
ja: 初期化失敗の伝播

source: Properties
ja: プロパティ

source: Properties can only be accessed, and methods can only be called, once the class instance is known to be valid at the end of the first phase.
ja: 一旦クラスインスタンスが第１段階の終わりに有効であるということを知られる場合にのみ、プロパティはアクセスされることができ、そしてメソッドは呼ばれることができます。

source: Properties of a structure instance can be accessed using dot (.) syntax, as described in Accessing Properties.
ja: クラスインスタンスのプロパティにドット（.）構文でアクセスされることができます、プロパティにアクセスするで記述されるように。

source: Properties of optional type are automatically initialized with a value of nil, indicating that the property is deliberately intended to have “no value yet” during initialization.
ja: オプショナルの型のプロパティは、nilの値で自動的に初期化されて、そのプロパティは初期化の時には「まだ無い値」を故意に持つつもりであることを示しています。

source: Properties, methods, and initializers of an existing type can’t be overridden in an extension of that type.
ja: 既存の型のプロパティ、メソッド、そしてイニシャライザは、その型の拡張においてオーバーライドされることができません。

source: Property Observers
ja: プロパティオブザーバー

source: Property Requirements
ja: プロパティ要件

source: Property Wrappers
ja: プロパティラッパー

source: Property observers are called every time a property’s value is set, even if the new value is the same as the property’s current value.
ja: プロパティオブザーバーは、あるプロパティの値が設定されるたびに、たとえ新しい値がそのプロパティの現在の値と同じものであるとしても、呼ばれます。

source: Property observers aren’t called when ARC sets a weak reference to nil.
ja: プロパティオブザーバーは、ARCが弱い参照をnilに設定するとき呼び出されません。

source: Property observers can be added to any property, regardless of whether it was originally defined as a stored or computed property.
ja: プロパティオブザーバーは、どんなプロパティにでも加えられることができます、それが格納または計算プロパティとして元々定義されたかどうかは関係ありません。

source: Property observers can be added to stored properties you define yourself, and also to properties that a subclass inherits from its superclass.
ja: プロパティオブザーバーは、あなたがあなた自身で定義する格納プロパティに、そのうえにサブクラスがそのスーパークラスから継承するプロパティにも加えられることができます。

source: Property observers observe and respond to changes in a property’s value.
ja: プロパティオブザーバーは、あるプロパティの値の変化を観察して、応答します。

source: Property overriding is described in Overriding.
ja: プロパティをオーバーライドすることはオーバーライドで記述されます。

source: Property requirements are always declared as variable properties, prefixed with the var keyword.
ja: プロパティ要件は常に変数プロパティとして宣言されます、それでvarキーワードを前に置かれます。

source: Protocol Associated Type Declaration
ja: プロトコル関連型宣言

source: Protocol Composition
ja: プロトコル合成

source: Protocol Composition Type
ja: プロトコル合成型

source: Protocol Conformance
ja: プロトコル準拠

source: Protocol Conformance Must Not Be Redundant
ja: プロトコル準拠は冗長であってはいけません

source: Protocol Declaration
ja: プロトコル宣言

source: Protocol Extensions
ja: プロトコル拡張

source: Protocol Inheritance
ja: プロトコル継承

source: Protocol Initializer Declaration
ja: プロトコルイニシャライザ宣言

source: Protocol Method Declaration
ja: プロトコルメソッド宣言

source: Protocol Property Declaration
ja: プロトコルプロパティ宣言

source: Protocol Subscript Declaration
ja: プロトコル添え字宣言

source: Protocol Syntax
ja: プロトコル構文

source: Protocol casts are no longer limited to @objc protocols.
ja: プロトコルのキャストは、もはや@objcプロトコルに制限されません。

source: Protocol composition types have the following form:
ja: プロトコル合成型は、以下の形式を持ちます：

source: Protocol composition types may be used only when specifying a type in type annotations, in generic parameter clauses, and in generic where clauses.
ja: プロトコル合成型は、型注釈において、総称体パラメータ節において、そして総称体where節において型を指定する場合にのみ使われるでしょう。

source: Protocol compositions behave as if you defined a temporary local protocol that has the combined requirements of all protocols in the composition.
ja: プロトコル合成は、あなたが全てのプロトコルの要件を結合したものをその合成物の中に持っている一時的なローカルプロトコルを定義したかのように振る舞います。

source: Protocol compositions don’t define any new protocol types.
ja: プロトコル合成は、何ら新しいプロトコル型を定義しません。

source: Protocol compositions have the form SomeProtocol & AnotherProtocol.
ja: プロトコル合成は、形式SomeProtocol & AnotherProtocolを持ちます。

source: Protocol declarations are declared at global scope using the protocol keyword and have the following form:
ja: プロトコル宣言は、グローバルなスコープでキーワードprotocolを使って宣言されて、以下の形式を持ちます：

source: Protocol declarations can’t contain class, structure, enumeration, or other protocol declarations.
ja: プロトコル宣言は、クラス、構造体、列挙、または他のプロトコル宣言を含むことができません。

source: Protocol declarations can’t include opaque types.
ja: プロトコル宣言は、不透明型を含むことはできません。

source: Protocol extensions can add implementations to conforming types but can’t make a protocol extend or inherit from another protocol.
ja: プロトコル拡張は、実装を加えることによって型に準拠が可能です、しかしあるプロトコルを別のプロトコルから拡張したり継承したりはできません。

source: Protocol inheritance is always specified in the protocol declaration itself.
ja: プロトコル継承は、常にプロトコル宣言それ自体の中で指定されます。

source: Protocol initializer declarations have the same form as initializer declarations, except they don’t include the initializer’s body.
ja: プロトコルイニシャライザ宣言は、それらがイニシャライザ本文を含めないことを除いて、イニシャライザ宣言と同じ形式を持ちます。

source: Protocol method declarations have the same form as function declarations, with two exceptions: They don’t include a function body, and you can’t provide any default parameter values as part of the function declaration.
ja: プロトコルメソッド宣言は、２つの例外を除いて、関数宣言と同じ形式を持ちます：それらは関数本体を含むことができません、そして、あなたは関数宣言の一部として省略時のパラメータ値をまったく提供することができません。

source: Protocol property declarations have a special form of a variable declaration:
ja: プロトコルプロパティ宣言は、変数宣言の特別な形式を持ちます：

source: Protocol requirements with default implementations provided by extensions are distinct from optional protocol requirements.
ja: 拡張によって提供される省略時の実装を持つプロトコル要件は、オプショナルプロトコル要件とは異なったものです。

source: Protocol subscript declarations have a special form of a subscript declaration:
ja: プロトコル添え字宣言は、添え字宣言の特別な形式を持ちます：

source: Protocol types can inherit from any number of other protocols.
ja: プロトコル型は、いくらかの他のプロトコルから継承することができます。

source: Protocols
ja: プロトコル

source: Protocols and Extensions
ja: プロトコルと拡張

source: Protocols are named types, and thus they can appear in all the same places in your code as other named types, as discussed in Protocols as Types.
ja: プロトコルは名前をつけられた型です、したがってそれらはあなたのコードにおいて他の名前をつけられた型と同じ場所の全てにおいて現れることができます、型としてのプロトコルで議論されるように。

source: Protocols as Types
ja: 型としてのプロトコル

source: Protocols can also declare special kinds of type aliases, called associated types, that can specify relationships among the various declarations of the protocol.
ja: プロトコルはまた、特別な種類の型エイリアス、そのプロトコルのいろいろな宣言の間での関係を指定することができる関連型と呼ばれるものを宣言することができます。

source: Protocols can be extended to provide method, initializer, subscript, and computed property implementations to conforming types.
ja: プロトコルは拡張されることによって、準拠している型にメソッド、イニシャライザ、添え字、そして計算プロパティの実装を提供できます。

source: Protocols can be restricted to a certain context, as can global constants, variables, and functions.
ja: プロトコルは特定の前後関係に制限されることができます、グローバルな定数、変数、そして関数も同じようにされることができます。

source: Protocols can define failable initializer requirements for conforming types, as defined in Failable Initializers.
ja: プロトコルは、失敗できるイニシャライザで記述されるように、準拠している型に対して失敗できるイニシャライザ要件を定義することができます。

source: Protocols can require specific initializers to be implemented by conforming types.
ja: プロトコルは、準拠型によって特定のイニシャライザが実装されるように要求することができます。

source: Protocols can require specific instance methods and type methods to be implemented by conforming types.
ja: プロトコルは、準拠型によって特定のインスタンスメソッドと型メソッドが実装されるように要求することができます。

source: Protocols declare associated types using the associatedtype keyword.
ja: プロトコルは、関連型をキーワードassociatedtypeを使って宣言します。

source: Protocols declare that conforming types must implement a method by including a protocol method declaration in the body of the protocol declaration.
ja: プロトコルが宣言するのは、準拠している型は、プロトコル宣言の本文中のプロトコルメソッド宣言を含めることによって、あるメソッドを実装する必要があるということです。

source: Protocols declare that conforming types must implement a property by including a protocol property declaration in the body of the protocol declaration.
ja: プロトコルは、準拠している型がそのプロトコル宣言の本文の中のプロトコルプロパティ宣言を含めることによってプロパティを実装しなければならないことを宣言します。

source: Protocols declare that conforming types must implement a subscript by including a protocol subscript declaration in the body of the protocol declaration.
ja: プロトコルは、準拠している型がそのプロトコル宣言の本文の中のプロトコル添え字宣言を含めることによって添え字を実装しなければならないと宣言します。

source: Protocols declare that conforming types must implement an initializer by including a protocol initializer declaration in the body of the protocol declaration.
ja: プロトコルは、準拠している型がそのプロトコル宣言の本文の中のプロトコルイニシャライザ宣言を含めることによってイニシャライザを実装しなければならないと宣言します。

source: Protocols don’t actually implement any functionality themselves.
ja: プロトコルは、実際に少しの機能性も実装しません。

source: Protocols that are marked with the objc attribute can’t inherit from protocols that aren’t marked with this attribute.
ja: objc属性で印されるプロトコルは、この属性で印されないプロトコルから継承できません。

source: Provide new initializers
ja: 新しいイニシャライザを提供する

source: Providing Default Implementations
ja: 省略時の実装を提供する

source: Providing a value when you create a constant or variable lets the compiler infer its type.
ja: あなたが定数または変数をつくる時に値を提供することは、コンパイラにその型を推論させます。

source: Providing error handling when values get too large or too small gives you much more flexibility when coding for boundary value conditions.
ja: 値があまりに大きいかあまりに小さくなる時にエラー処理を提供することは、境界値条件のためのコードを書くとき、あなたにずっと多くの柔軟性を与えます。

source: Providing more detail limits which symbols are imported—you can specify a specific submodule or a specific declaration within a module or submodule.
ja: より詳細な記述を提供することは、どのシンボルがインポートされるかを制限します ― あなたは、あるモジュールまたはサブモジュール内で、特定のサブモジュールまたは特定の宣言を指定することができます。

source: Put another way, protoFlip(_:) makes a much looser API contract with its caller than flip(_:) makes.
ja: 言い換えれば、protoFlip(_:)は、それの呼び出し側とずっとゆるいAPI契約をします、flip(_:)がするよりも。

source: Querying and Setting Type Properties
ja: 型プロパティを問い合わせて、設定する

source: Range Operators
ja: 範囲演算子

source: Rather than a copy, a reference to the same existing instance is used.
ja: コピーではなく、既存の同じインスタンスに対する参照が使われます。

source: Rather than moving the player immediately, the loop uses a switch statement to consider the result of the move and to determine whether the move is allowed:
ja: 直ちにプレーヤーを動かすのではなく、ループはswitch文を使うことで、移動の結果を考慮して、移動が許可されるかどうか判断します：

source: Rather than placing an exclamation point after the optional’s name when you use it, you place an exclamation point after the optional’s type when you declare it.
ja: あなたがそれを使う時にそのオプショナルのもつ名前の後に感嘆符を置くよりも、あなたがそれを宣言する時にそのオプショナルのもつ型の後に感嘆符を書きたいとあなたは思うでしょう。

source: Rather than returning an existing value, the getter actually calculates and returns a new Point to represent the center of the square.
ja: 既存の値を返すのではなく、このゲッターは正方形の中心を表すために実際に計算して新しいPointを返します。

source: Rather, it reports a compile-time error that case "a": does not contain any executable statements.
ja: そうではなく、それはcase "a":が実行可能な文を何も含まないという、コンパイル時エラーを報告します。

source: Rather, their role is to ensure that self is fully and correctly initialized by the time that initialization ends.
ja: というより、それの役割は、初期化が終わるまでにselfが完全にそして正確に初期化されることを確実にすることです。

source: Raw Values
ja: 生の値

source: Raw Values and Associated Values
ja: 生の値と関連値

source: Raw values are not the same as associated values.
ja: 生の値は、関連値と同じものでない点に注意してください。

source: Raw values are set to prepopulated values when you first define the enumeration in your code, like the three ASCII codes above.
ja: 生の値は、上の３つのASCIIコードの様に、あなたがあなたのコードにおいて最初に列挙を定義するとき、あらかじめ入れられた値に設定されます。

source: Raw values can be strings, characters, or any of the integer or floating-point number types.
ja: 生の値は、文字列、文字、または何らかの整数や浮動小数点数型であることができます。

source: Read-Only Computed Properties
ja: 読み出し専用の計算プロパティ

source: Readability is always preferred over brevity; use parentheses where they help to make your intentions clear.
ja: 読みやすさは、常に簡潔さよりも好まれます；それらがあなたの意図を明確にする助けとなるところに丸括弧を使ってください。

source: Reading the total amount during the process of adding an item gives you incorrect information.
ja: ある項目を追加する処理の間に総支出額を読み出すことは、あなたに正しくない情報を与えます。

source: Recursive Enumerations
ja: 再帰列挙

source: Reference counting allows more than one reference to a class instance.
ja: 参照カウントは、あるクラスインスタンスに対する１つ以上の参照を許します。

source: Reference counting applies only to instances of classes.
ja: 参照カウントが唯一適用されるのは、クラスのインスタンスに対してです。

source: Referring to Nested Types
ja: 入れ子にされた型を参照する

source: Remainder Operator
ja: 剰余演算子

source: Remainder and multiplication both associate with the expression to their left.
ja: 剰余と乗算は、両方とも式をそれらの左と結びつけます。

source: Remove the day parameter.
ja: dayパラメータを取り除いてください。

source: Removed a duplicate description of the valid set of operator characters from Custom Operators.
ja: 有効な演算子の一式の重複する説明をあつらえの演算子から取り除きました。

source: Removed a note to the contrary.
ja: これに反する注意書きを取り除きました。

source: Removed discussion of C-style for loops, the ++ prefix and postfix operators, and the -- prefix and postfix operators.
ja: C形式forループ、++接頭辞および接尾辞演算子、そして--接頭辞および接尾辞演算子の議論を削除した。

source: Removed discussion of variable function arguments and the special syntax for curried functions.
ja: 変数関数引数とカリー化関数のための特別な構文の議論を削除した。

source: Removed the Dynamic Type Expression section from the Expressions chapter, now that type(of:) is a Swift standard library function.
ja: 「動的型式」の節を式の章から削除した、今ではtype(of:)はスウィフト標準ライブラリ関数であるので。

source: Removed the discussion of explicitly using let in function parameters from the Function Declaration section.
ja: 明示的にletを関数パラメータにおいて使用することの解説を節関数宣言から削除した。

source: Removed the discussion of the Boolean protocol from the Statements chapter, now that the protocol has been removed from the Swift standard library.
ja: Booleanプロトコルの解説を文の章から削除した、今ではこのプロトコルはスウィフト標準ライブラリから削除されてしまったので。

source: Removed the overflow division (&/) and overflow remainder (&%) operators from Overflow Operators.
ja: オーバフロー除算（&/）とオーバフロー剰余（&%）演算子をオーバフロー演算子から削除しました。

source: Repeat-While
ja: 終わりに評価

source: Repeat-While Statement
ja: repeat-while文

source: Representing and Throwing Errors
ja: エラーの表現とスロー

source: Required Initializers
ja: 必須イニシャライザ

source: Requiring exhaustiveness ensures that enumeration cases aren’t accidentally omitted.
ja: 網羅性を要求することは、列挙ケース節のどれかがうっかり書き落とされないことを確実にします。

source: Resolving Explicit Redundancy
ja: 明示的な冗長性を解決する

source: Resolving Implicit Redundancy
ja: 暗黙的な冗長性を解決する

source: Resolving Strong Reference Cycles Between Class Instances
ja: クラスインスタンス間の強い参照循環の解消

source: Resolving Strong Reference Cycles for Closures
ja: クロージャのための強い参照循環の解消

source: Restrictions for Nonescaping Closures
ja: 非脱出クロージャに対する規制

source: Rethrowing Functions and Methods
ja: 再スローを行う関数とメソッド

source: Rethrowing functions and methods must have at least one throwing function parameter.
ja: 再スロー関数とメソッドは、少なくとも１つのスロー関数パラメーターを持たなければなりません。

source: Retrieve a value from the array by using subscript syntax, passing the index of the value you want to retrieve within square brackets immediately after the name of the array:
ja: 添え字構文を使うことで、ひとつの値をこの配列から取り出してください、あなたが取り出したい値の添え字（インデックス、指数）を、配列の名前の直後の角括弧内に入れて渡してください：

source: Return Statement
ja: 復帰文

source: Return values can be ignored, but a function that says it will return a value must always do so.
ja: 戻り値は無視されることができます、しかし値を返すつもりだと言う関数は、常にそうしなければなりません。

source: Returning an Opaque Type
ja: 不透明型を返す

source: Returning an opaque type looks very similar to using a protocol type as the return type of a function, but these two kinds of return type differ in whether they preserve type identity.
ja: 不透明型を返すことは、プロトコル型を関数の戻り型として使うことと大変よく似て見えます、しかしこれら２つの種類の戻り型は、それらが型同一性を保全するかどうかにおいて異なります。

source: Revision History
ja: 改訂履歴

source: Rewrite the closure to return zero for all odd numbers.
ja: このクロージャを、全ての奇数に対してゼロを返すように書き直してください。

source: Rewrote the Inheritance chapter to remove its introductory coverage of initializer overrides.
ja: 章継承を書き直して、それの前置きのイニシャライザのオーバーライドを扱った部分を取り除きました。

source: Rule 1
ja: 規則１

source: Rule 2
ja: 規則２

source: Rule 3
ja: 規則３

source: Safety check 1
ja: 安全点検１

source: Safety check 2
ja: 安全点検２

source: Safety check 3
ja: 安全点検３

source: Safety check 4
ja: 安全点検４

source: Scalar values that have been assigned to a character typically also have a name, such as LATIN SMALL LETTER A and FRONT-FACING BABY CHICK in the examples above.
ja: ある文字に割り当てられるスカラー値は、たいてい名前を持っています、例えば以前の例でのLATIN SMALL LETTER AとFRONT-FACING BABY CHICKなど。

source: Second, even if dataSource does exist, there’s no guarantee that it implements increment(forCount:), because it’s an optional requirement.
ja: 第２に、たとえdataSourceが存在するとしても、それがincrement(forCount:)を実装する保証はありません、それがオプショナルの要件であるからです。

source: Second, the two’s complement representation also lets you shift the bits of negative numbers to the left and right like positive numbers, and still end up doubling them for every shift you make to the left, or halving them for every shift you make to the right.
ja: 第２に、２の補数表現はまた、あなたに負数のビットを左や右に正の数のようにシフトさせます、そして依然としてあなたが左へとするシフトは全てそれを２倍にすることで、またあなたが右へとするシフトは全てそれを半分にすることで終わります。

source: See Precedence and Associativity for an explanation of how these characteristics affect an infix operator’s interaction with other infix operators.
ja: 優先順位と結合性をどのようにそれらの特徴が接中辞演算子の他の接中辞演算子との相互作用に影響を及ぼすかの解説として見てください。

source: See Special Characters in String Literals.
ja: 更なる情報として、文字列リテラル内の特別な文字を見てください。

source: See Overflow Operators.
ja: オーバフロー演算子を見てください。

source: See also Function Declaration.
ja: また、関数宣言を見てください。

source: See also Initializer Declaration.
ja: また、イニシャライザ宣言を見てください。

source: See also Protocol Associated Type Declaration.
ja: また、プロトコル関連型宣言を見てください。

source: See also Subscript Declaration.
ja: また、添え字宣言を見てください。

source: See also Type Alias Declaration.
ja: また、型エイリアス宣言を見てください。

source: See also Variable Declaration.
ja: また、変数の宣言を見てください。

source: Selector Expression
ja: セレクタ式

source: Self Expression
ja: self式

source: Self Type
ja: Self型

source: Semicolons
ja: セミコロン

source: Separate each requirement in the list with a comma.
ja: リストの中の各要件をコンマで区切ってください。

source: Set b and set c are disjoint with one another, because they share no elements in common.
ja: 集合bと集合cは、他のものと互いに素です（交わりを持たない）、なぜならそれらが共通の要素を共有しないからです。

source: Set a is a superset of set b, because a contains all elements in b.
ja: 集合aは集合bの上位集合です、なぜならaがbのすべての要素を含むからです。

source: Set Membership and Equality
ja: 集合の帰属と等価性

source: Set Type Syntax
ja: Set型構文

source: Sets
ja: 集合

source: Sets are unordered collections of unique values.
ja: 集合は、順番をつけられないそれぞれが異なった値のコレクションです。

source: Setting Initial Values for Stored Properties
ja: 初期値を格納プロパティに設定する

source: Setting Initial Values for Wrapped Properties
ja: ラップされたプロパティに初期値を設定する

source: Setting a Default Property Value with a Closure or Function
ja: 省略時のプロパティ値をクロージャまたは関数を使って設定する

source: Setting the center property calls the setter for center, which modifies the x and y values of the stored origin property, and moves the square to its new position.
ja: centerプロパティを設定することは、centerのためのセッターを呼び出します、そしてそれは、格納されたoriginプロパティのxとy値を修正して、正方形をその新しい位置へと動かします。

source: Setting the value of properties that the subclass declares.
ja: サブクラスが宣言するプロパティの値を設定する。

source: Several methods that have special names enable syntactic sugar for function call syntax.
ja: 特殊名を持つ幾つかのメソッドは、関数呼び出し構文に対して構文糖を可能にします。

source: Several of the switch statement’s cases bind their matched value to a constant of the specified type to enable its value to be printed:
ja: switch文のケース節のいくつかは、それらが適合した値を指定された型のある定数に結び付け、その値を出力できるようにします：

source: Shifting Behavior for Signed Integers
ja: 符号つき整数のためのシフト挙動

source: Shifting Behavior for Unsigned Integers
ja: 符号なし整数のためのシフト挙動

source: Shifting an integer’s bits to the left by one position doubles its value, whereas shifting it to the right by one position halves its value.
ja: 整数のビットを位置１つだけ左へ移すことはその値を２倍にします、一方それを位置１つだけ右へ移すことはその値を半分にします。

source: Shorthand Argument Names
ja: 短縮形引数名

source: Shorthand Getter Declaration
ja: 短縮形ゲッター宣言

source: Shorthand Setter Declaration
ja: 短縮形セッター宣言

source: Shorthand argument names
ja: 短縮形引数名

source: Signed integers use their first bit (known as the sign bit) to indicate whether the integer is positive or negative.
ja: 符号つき整数は、それらの最初のビット（符号ビットとして知られるもの）を使って、その整数が正であるか負であるかを示します。

source: Similar to an if statement, you can add multiple conditional branches to test for different compilation conditions.
ja: if文と同様に、あなたは複数の条件分岐を加えて、異なるコンパイル条件に対してテストすることができます。

source: Similarly, ###"Line1\###nLine2"### also breaks the line.
ja: 同様に、###"Line1\###nLine2"###もまた行を改めます。

source: Similarly, 0xFp-2 represents 15 x 2-2, which evaluates to 3.75.
ja: 同じように、0xFp-2は15 × 2-2を表します、それは3.75に評価されます。

source: Similarly, 1.25e-2 represents 1.25 x 10-2, which evaluates to 0.0125.
ja: 同じように、1.25e-2は1.25 × 10-2を表します、それは0.0125に評価されます。

source: Similarly, item is Song checks whether the item is a Song instance.
ja: 同じように、item is Songはその項目がSongインスタンスであるか調べます。

source: Similarly, a method marked with the nonobjc attribute can’t satisfy a protocol requirement for a method marked with the objc attribute.
ja: 同様に、nonobjc属性で印されるメソッドは、objc属性で印されるメソッドに対するプロトコル要件を満たすことは出来ません。

source: Similarly, a stack allows items to be removed only from the end of the collection (known as popping a value off the stack).
ja: 同じように、スタックは項目をコレクションの終わりからだけ取り除かれることが許されます（値をスタックからポップするとして知られます）。

source: Similarly, a subclass failable initializer can delegate up to a superclass failable initializer.
ja: 同じように、サブクラスの失敗できるイニシャライザは、スーパークラスの失敗できるイニシャライザにさかのぼって委任することができます。

source: Similarly, a subscript can’t be more public than either its index type or return type.
ja: 同じように、添え字はそのインデックス型や戻り型よりも公開であることはできません。

source: Similarly, every Apartment instance has a unit property of type String and has an optional tenant property that is initially nil.
ja: 同じように、あらゆるApartmentインスタンスは、型Stringのunitプロパティを持って、初期時にはnilであるオプショナルのtenantプロパティを持ちます。

source: Similarly, if you have multiple nested loops, it can be useful to be explicit about which loop the continue statement should affect.
ja: 同じように、あなたが複数の入れ子にされたループを持つならば、continue文が影響を及ぼさなければならないループはどれかについて明確にすることは役に立つでしょう。

source: Similarly, if you implement a didSet observer, it’s passed a constant parameter containing the old property value.
ja: 同じように、あなたがdidSetオブザーバーを実装するならば、それは古いプロパティ値を含んでいる定数パラメータを渡されます。

source: Similarly, if you try to create a CartItem instance with an empty name value, the superclass Product initializer causes initialization to fail:
ja: 同様に、あなたがCartItemインスタンスを空のname値で作成することを試みるならば、スーパークラスのProductイニシャライザは初期化が失敗する原因となります：

source: Similarly, if you try to retrieve an Int? value through optional chaining, an Int? is always returned, no matter how many levels of chaining are used.
ja: 同じように、あなたがオプショナル連鎖を通してInt?値を取り出そうと試すならば、Int?が常に返されます、どんなに多くの連鎖階層が使われようともです。

source: Similarly, it can be convenient to define utility classes and structures purely for use within the context of a more complex type.
ja: 同じように、あくまでもより複雑な型の文脈内で使用するだけの有用なクラスや構造体を定義することは、便利でありえます。
